VR-addicted/P4-ST7701s-LovyanGFX/sdkconfig.defaults
# Ziel-CPU festlegen
CONFIG_IDF_TARGET="esp32p4"

# Flash-Einstellungen (Wichtig für 16MB Flash)
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# PSRAM (SPIRAM) - Überlebenswichtig für das MIPI-Display
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y

# Cache-Einstellungen für Performance
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# Mehr Stack für den Main Task (Vermeidet Stack Overflows)
CONFIG_ESP_main_TASK_STACK_SIZE=10240

# Erlaubt malloc(), den Speicher automatisch im PSRAM zu finden
CONFIG_SPIRAM_USE_MALLOC=y

# Verhindert, dass der Chip bei kleinen Allokationen das langsame PSRAM nimmt
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# Nutze die eigene Partitionstabelle
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Flash-Größe auf 16MB festnageln
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
